USE BOOKS_MANAGEMENT_SYSTEM
CREATE TABLE BOOKS_INFO
(BNA CHAR(20) NOT NULL ,
BNO CHAR(5) PRIMARY KEY,
BDA INT,
BPU CHAR(15),
BPL CHAR(10),
BorrowInfo CHAR(5) )




INSERT INTO BOOKS_INFO
VALUES ('数据结构 ',  'SJ001',  2018,'清华大学出版社 ',  '计科书架 ', '0'),
 ('数据结构 ',  'SJ002',  2018,'清华大学出版社',  '计科书架 ', '10001'),
 ('数据结构 ',  'SJ003',  2018,'清华大学出版社',  '计科书架 ', '0'),
 ('数据结构 ',  'SJ004',  2018,'清华大学出版社',  '计科书架 ', '0'),
 ('操作系统 ',  'CZ001',  2017,'北京大学出版社',  '计科书架 ', '0'),
 ('操作系统 ',  'CZ002',  2017,'北京大学出版社',  '计科书架 ', '0'),
 ('操作系统 ',  'CZ003',  2017,'北京大学出版社',  '计科书架 ', '0'),
 ('LINUX私房菜',  'LN001',  2014,'浙江大学出版社',  '计科书架 ', '10001'),
 ('LINUX私房菜',  'LN002',  2014,'浙江大学出版社',  '计科书架 ', '0'),
 ('信息安全法律基础',  'XX001',  2019,'人民大学出版社',  '人文书架 ', '10005'),
 ('信息安全法律基础',  'XX002',  2019,'人民大学出版社',  '人文书架 ', '0'),
 ('信息安全法律基础',  'XX003',  2019,'人民大学出版社',  '人文书架 ', '0'),
 ('数据库程序设计',  'SK001',  2018,'复旦大学出版社',  '人文书架 ', '10003'),
 ('数据库程序设计',  'SK002',  2018,'复旦大学出版社',  '人文书架 ', '0'),
 ('数据库程序设计',  'SK003',  2018,'复旦大学出版社',  '人文书架 ', '0'),
 ('数据库程序设计',  'SK004',  2018,'复旦大学出版社',  '人文书架 ', '0'),
 ('数据库程序设计',  'SK005',  2018,'复旦大学出版社',  '人文书架 ', '0');
